var star=star||{};
star.Home=function(){
	var s = this;
	F2xMovieClip.call(s);
	s.initUI();
	s.isSelectStar = false;
	s.isSelectBlood = false;
	//当前血型
	s.lastSelectBlood = "";

	//血型按钮事件监听
	s.goNextFrame(s,"A");
	s.goNextFrame(s,"B");
	s.goNextFrame(s,"AB");
	s.goNextFrame(s,"O");

	//星座圆盘的转动圆点
	s.round_mc.round.anchorX = 338.65;
	s.round_mc.round.anchorY = 338.65;
	s.nextPage.addEventListener("onMouseUp",function(){
		if(s.isSelectStar && s.isSelectBlood){
			s.nextPage.gotoAndStop(2);
			s.play(false);
			s.addFrameScript(0,function(){
				globalVal.stage.removeAllChildren();
				Flash2x.getMediaByName("loading","ChangePageSound").play(0,1);
				globalVal.stage.addChild(new selectTopic.SelectTopic());
			});

			var lastStar;
			switch (s.round_mc.round.currentStar){
				case 1:
					lastStar = "双鱼座";
					break;
				case 2:
					lastStar = "水瓶座";
					break;
				case 3:
					lastStar = "摩羯座";
					break;
				case 4:
					lastStar = "射手座";
					break;
				case 5:
					lastStar = "天蝎座";
					break;
				case 6:
					lastStar = "天枰座";
					break;
				case 7:
					lastStar = "处女座";
					break;
				case 8:
					lastStar = "狮子座";
					break;
				case 9:
					lastStar = "巨蟹座";
					break;
				case 10:
					lastStar = "双子座";
					break;
				case 11:
					lastStar = "金牛座";
					break;
				case 12:
					lastStar = "白羊座";
					break;
			}
			var starMessage = globalVal.getMessage("http://oled.help2x.com/index.php/index/index/selectStart","post",
				{constellation: lastStar,blood: s.lastSelectBlood});
			if(starMessage.code == 1){
				globalVal.userId = starMessage.activityId;
			}
		}
	});


};
F2xExtend(star.Home,F2xMovieClip);
star.Home.prototype.initUI=function(){
	var s = this;
	//f2x_auto_created_init_start
	var _d0=new star.F2xAuto_16();
	_d0.name="nextPage";
	s.nextPage=_d0;
	var _d1=new star.F2xAuto_17();
	var _d2=new star.F2xAuto_18();
	var _d3=new star.F2xAuto_19();
	var _d4=new star.F2xAuto_13();
	var _d5=new star.F2xAuto_20();
	var _d6=new star.F2xAuto_12();
	var _d7=new star.F2xAuto_11();
	_d7.name="round_mc";
	s.round_mc=_d7;
	var _d8=new star.F2xAuto_14();
	var _d9=new star.F2xAuto_24();
	var _d10=new star.F2xAuto_25();
	_d10.name="O";
	s.O=_d10;
	var _d11=new star.F2xAuto_26();
	_d11.name="AB";
	s.AB=_d11;
	var _d12=new star.F2xAuto_27();
	_d12.name="B";
	s.B=_d12;
	var _d13=new star.F2xAuto_28();
	_d13.name="A";
	s.A=_d13;
	var _d14=new star.F2xAuto_10();
	s.a().b(33).b(1).c(_d0,{x:340.6,y:1055,o:0.1992}).b(1).c(_d0,{x:340.6,y:1049.4,o:0.4102}).b(1).c(_d0,{x:340.6,y:1045,o:0.5898}).b(1).c(_d0,{x:340.6,y:1041.4,o:0.7383}).b(1).c(_d0,{x:340.6,y:1038.65,o:0.8516}).b(1).c(_d0,{x:340.6,y:1036.65,o:0.9336}).b(1).c(_d0,{x:340.6,y:1035.45,o:0.9844}).b(1).c(_d0,{x:340.6,y:1035.05});
	s.a().b(6).b(1).c(_d1,{x:272.05,y:82,o:0}).b(1).c(_d1,{x:272.05,y:92.8,o:0.3594}).b(1).c(_d1,{x:272.05,y:101.2,o:0.6406}).b(1).c(_d1,{x:272.05,y:107.2,o:0.8398}).b(1).c(_d1,{x:272.05,y:110.8,o:0.9609}).b(1).c(_d1,{x:272.05,y:112}).b(1).c(_d1,{x:272.05,y:107.65}).b(1).c(_d1,{x:272.05,y:104.5}).b(1).c(_d1,{x:272.05,y:102.65}).b(26).c(_d1,{x:272.05,y:102});
	s.a().b(8).b(1).c(_d2,{x:167,y:142.05,o:0}).b(1).c(_d2,{x:167,y:152.85,o:0.3594}).b(1).c(_d2,{x:167,y:161.25,o:0.6406}).b(1).c(_d2,{x:167,y:167.25,o:0.8398}).b(1).c(_d2,{x:167,y:170.85,o:0.9609}).b(1).c(_d2,{x:167,y:172.05}).b(1).c(_d2,{x:167,y:167.7}).b(1).c(_d2,{x:167,y:164.55}).b(1).c(_d2,{x:167,y:162.7}).b(24).c(_d2,{x:167,y:162.05});
	s.a().b(9).b(1).c(_d3,{x:276.05,y:208.9,o:0}).b(1).c(_d3,{x:276.05,y:219.7,o:0.3594}).b(1).c(_d3,{x:276.05,y:228.1,o:0.6406}).b(1).c(_d3,{x:276.05,y:234.1,o:0.8398}).b(1).c(_d3,{x:276.05,y:237.7,o:0.9609}).b(1).c(_d3,{x:276.05,y:238.9}).b(1).c(_d3,{x:276.05,y:234.55}).b(1).c(_d3,{x:276.05,y:231.4}).b(1).c(_d3,{x:276.05,y:229.55}).b(23).c(_d3,{x:276.05,y:228.9});
	s.a().b(1).c(_d4,{x:174,y:-208,o:0}).b(1).c(_d4,{x:174,y:-104.4,o:0.3047}).b(1).c(_d4,{x:174,y:-19.65,o:0.5547}).b(1).c(_d4,{x:174,y:46.25,o:0.75}).b(1).c(_d4,{x:174,y:93.35,o:0.8906}).b(1).c(_d4,{x:174,y:121.6,o:0.9727}).b(1).c(_d4,{x:174,y:131}).b(1).c(_d4,{x:174,y:128.15}).b(1).c(_d4,{x:174,y:125.3}).b(1).c(_d4,{x:174,y:122.45}).b(1).c(_d4,{x:174,y:119.55}).b(1).c(_d4,{x:174,y:116.7}).b(1).c(_d4,{x:174,y:113.85}).b(28).c(_d4,{x:174,y:111});
	s.a().b(10).b(1).c(_d5,{x:157.4,y:341,a:0.2,o:0}).b(1).c(_d5,{x:160.7,y:341,a:0.3333,o:0.168}).b(1).c(_d5,{x:163.9,y:341,a:0.4667,o:0.332}).b(1).c(_d5,{x:167.2,y:341,a:0.6,o:0.5}).b(1).c(_d5,{x:170.5,y:341,a:0.7333,o:0.668}).b(1).c(_d5,{x:173.75,y:341,a:0.8667,o:0.832}).b(1).c(_d5,{x:177,y:341}).b(1).c(_d5,{x:175,y:341}).b(1).c(_d5,{x:173,y:341}).b(1).c(_d5,{x:171,y:341}).b(21).c(_d5,{x:169,y:341});
	s.a().b(22).b(1).c(_d6,{x:427.9,y:611,a:0.1,b:0.1}).b(1).c(_d6,{x:408.55,y:601.45,a:0.3388,b:0.3388}).b(1).c(_d6,{x:392.15,y:593.4,a:0.5408,b:0.5408}).b(1).c(_d6,{x:378.8,y:586.75,a:0.7061,b:0.7061}).b(1).c(_d6,{x:368.35,y:581.65,a:0.8347,b:0.8347}).b(1).c(_d6,{x:360.95,y:577.95,a:0.9265,b:0.9265}).b(1).c(_d6,{x:356.5,y:575.75,a:0.9816,b:0.9816}).b(12).c(_d6,{x:355,y:575});
	s.a().b(13).b(1).c(_d7,{x:490.8,y:560.2,a:0.2,b:0.2,r:90,o:0}).b(1).c(_d7,{x:499.1,y:499.35,a:0.3386,b:0.3386,r:73.6765,o:0.1719}).b(1).c(_d7,{x:478.35,y:439.25,a:0.4638,b:0.4638,r:58.6606,o:0.332}).b(1).c(_d7,{x:436.1,y:390.3,a:0.5759,b:0.5759,r:45.1567,o:0.4727}).b(1).c(_d7,{x:382.25,y:356.95,a:0.675,b:0.675,r:33.3625,o:0.5938}).b(1).c(_d7,{x:325.4,y:339.05,a:0.7611,b:0.7611,r:23.2832,o:0.7031}).b(1).c(_d7,{x:270.1,y:334.4,a:0.8341,b:0.8341,r:14.5442,o:0.793}).b(1).c(_d7,{x:222.8,y:338.2,a:0.8939,b:0.8939,r:7.5186,o:0.8672}).b(1).c(_d7,{x:184.75,y:346.45,a:0.9404,b:0.9404,r:2.0168,o:0.9258}).b(1).c(_d7,{x:158.15,y:354.85,a:0.9735,b:0.9735,r:-1.7776,o:0.9688}).b(1).c(_d7,{x:142.2,y:361.05,a:0.9932,b:0.9932,r:-4.0553,o:0.9922}).b(1).c(_d7,{x:135.95,y:364.15,r:-5.0001}).b(1).c(_d7,{x:141.55,y:357.85,a:0.9997,b:0.9998,r:-3.7514}).b(1).c(_d7,{x:148.15,y:351.5,a:0.9997,b:0.9999,c:-2.3134,d:-2.502}).b(1).c(_d7,{x:153.95,y:345.35,a:0.9997,c:-1.0623,d:-1.2507}).b(13).c(_d7,{x:159,y:339.3,a:0.9996,r:0.0009});
	s.a().b(20).b(21).c(_d8,{x:205,y:396});
	s.a().b(24).b(1).c(_d9,{x:87,y:872.1,a:0.2,b:0.2,o:0}).b(1).c(_d9,{x:101.35,y:870.75,a:0.3333,b:0.3333,o:0.168}).b(1).c(_d9,{x:115.65,y:869.45,a:0.4667,b:0.4667,o:0.332}).b(1).c(_d9,{x:130,y:868.1,a:0.6,b:0.6,o:0.5}).b(1).c(_d9,{x:144.35,y:866.75,a:0.7333,b:0.7333,o:0.668}).b(1).c(_d9,{x:158.65,y:865.45,a:0.8667,b:0.8667,o:0.832}).b(1).c(_d9,{x:173.05,y:864}).b(1).c(_d9,{x:172.05,y:864}).b(1).c(_d9,{x:171.05,y:864}).b(1).c(_d9,{x:170.05,y:864}).b(7).c(_d9,{x:169.05,y:864});
	s.a().b(29).b(1).c(_d10,{x:590.75,y:935.75,a:0.5,b:0.5,o:0}).b(1).c(_d10,{x:593.5,y:926.3,a:0.6589,b:0.6589,o:0.3047}).b(1).c(_d10,{x:595.75,y:918.55,a:0.7889,b:0.7889,o:0.5547}).b(1).c(_d10,{x:597.55,y:912.55,a:0.89,b:0.89,o:0.75}).b(1).c(_d10,{x:598.8,y:908.25,a:0.9622,b:0.9622,o:0.8906}).b(1).c(_d10,{x:599.6,y:905.65,a:1.0055,b:1.0055,o:0.9727}).b(1).c(_d10,{x:599.8,y:904.8,a:1.02,b:1.02}).b(1).c(_d10,{x:596.6,y:905.2,a:1.0128,b:1.0128}).b(1).c(_d10,{x:594.2,y:905.55,a:1.0072,b:1.0072}).b(1).c(_d10,{x:592.45,y:905.75,a:1.0032,b:1.0032}).b(1).c(_d10,{x:591.35,y:905.95,a:1.0008,b:1.0008}).b(1).c(_d10,{x:591,y:906});
	s.a().b(27).b(1).c(_d11,{x:448.75,y:935.75,a:0.5,b:0.5,o:0}).b(1).c(_d11,{x:451.5,y:926.3,a:0.6589,b:0.6589,o:0.3047}).b(1).c(_d11,{x:453.75,y:918.55,a:0.7889,b:0.7889,o:0.5547}).b(1).c(_d11,{x:455.5,y:912.55,a:0.89,b:0.89,o:0.75}).b(1).c(_d11,{x:456.8,y:908.25,a:0.9622,b:0.9622,o:0.8906}).b(1).c(_d11,{x:457.55,y:905.65,a:1.0055,b:1.0055,o:0.9727}).b(1).c(_d11,{x:457.8,y:904.8,a:1.02,b:1.02}).b(1).c(_d11,{x:454.6,y:905.2,a:1.0128,b:1.0128}).b(1).c(_d11,{x:452.15,y:905.55,a:1.0072,b:1.0072}).b(1).c(_d11,{x:450.35,y:905.75,a:1.0032,b:1.0032}).b(1).c(_d11,{x:449.35,y:905.95,a:1.0008,b:1.0008}).b(3).c(_d11,{x:449,y:906});
	s.a().b(25).b(1).c(_d12,{x:307.2,y:935.75,a:0.5,b:0.5,o:0}).b(1).c(_d12,{x:309.9,y:926.3,a:0.6589,b:0.6589,o:0.3047}).b(1).c(_d12,{x:312.2,y:918.55,a:0.7889,b:0.7889,o:0.5547}).b(1).c(_d12,{x:314,y:912.55,a:0.89,b:0.89,o:0.75}).b(1).c(_d12,{x:315.25,y:908.25,a:0.9622,b:0.9622,o:0.8906}).b(1).c(_d12,{x:316,y:905.65,a:1.0055,b:1.0055,o:0.9727}).b(1).c(_d12,{x:316.25,y:904.8,a:1.02,b:1.02}).b(1).c(_d12,{x:313.05,y:905.2,a:1.0128,b:1.0128}).b(1).c(_d12,{x:310.65,y:905.55,a:1.0072,b:1.0072}).b(1).c(_d12,{x:308.85,y:905.75,a:1.0032,b:1.0032}).b(1).c(_d12,{x:307.8,y:905.95,a:1.0008,b:1.0008}).b(5).c(_d12,{x:307.45,y:906});
	s.a().b(22).b(1).c(_d13,{x:164.75,y:935.75,a:0.5,b:0.5,o:0}).b(1).c(_d13,{x:167.5,y:926.3,a:0.6589,b:0.6589,o:0.3047}).b(1).c(_d13,{x:169.8,y:918.55,a:0.7889,b:0.7889,o:0.5547}).b(1).c(_d13,{x:171.55,y:912.55,a:0.89,b:0.89,o:0.75}).b(1).c(_d13,{x:172.8,y:908.25,a:0.9622,b:0.9622,o:0.8906}).b(1).c(_d13,{x:173.6,y:905.65,a:1.0055,b:1.0055,o:0.9727}).b(1).c(_d13,{x:173.8,y:904.8,a:1.02,b:1.02}).b(1).c(_d13,{x:170.6,y:905.2,a:1.0128,b:1.0128}).b(1).c(_d13,{x:168.15,y:905.55,a:1.0072,b:1.0072}).b(1).c(_d13,{x:166.4,y:905.75,a:1.0032,b:1.0032}).b(1).c(_d13,{x:165.35,y:905.95,a:1.0008,b:1.0008}).b(8).c(_d13,{x:165,y:906});
	s.a().b(41).c(_d14);
	s.as(function(){this.stop();}.bind(this),40);
	//f2x_auto_created_init_end

};

star.Home.prototype.goNextFrame = function(s,blood){
	s[blood].addEventListener("onMouseUp",function(){
		Flash2x.getMediaByName("star","SelectSound").play(0,1);
		s.isSelectBlood = true;
		if(s.isSelectStar && s.isSelectBlood){
			s.nextPage.gotoAndStop(2);
		}
		s[blood].gotoAndStop(2);
		if(s.lastSelectBlood != "" && s.lastSelectBlood != blood){
			s[s.lastSelectBlood].gotoAndStop(1);
		}
		s.lastSelectBlood = blood;
	});
};
